//////////////////////////////////////////////////////////


var a = +prompt("Введите число");
var b = +prompt("Введите второе чило");
var c = 1;

for(let i = 1; i <= b; i++){
    c = c * a;
    if(c  <= 0 || isNaN(a) || isNaN(b) || isNaN(a && b) || a == 0 || b == 0 || a && b == 0){
        alert(" Одно из чисел рано нулю, либо вы не ввели чило ");
    }else{
        console.log(c);
    }
}


//////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////


var e = 5;
var f = ("-");
var g = ("*");
var h = (" ");


for(let i2 = 1; i2 <= e; i2++){
    h = h + f;
   console.log(h + g);
}


////////////////////////////////////////////////////////